[
    
    {
        "name": "Jos茅 Ottonello",
        "profile": "Frontend Dev",
        "description": "Desarrollador de interfaces de usuario, apasionado por React  y su stack de librerias. Innovador y empatico.",
        "path": "./images/profile.jpg"
    },
    {
        "type": "portfolio",
        "name": "Ecommerce Vans",
        "description": "Ecommerce como proyecto final para el curso de React de Coderhouse con el cual me posicion茅 en el top 10, utilizando hooks como useState para almacenar el estado de la compra, useEffect para optimizar el rendimiento de la aplicaci贸n y useContext para manipular la compra del usuario. Con la integraci贸n de librerias como React Router para movernos entre secciones optimizadas que nos evita la renderizacion y Material UI para una estilizaci贸n simple y ordenada.",
        "path": "./images/ecommerce.gif",
        "deploy": "https://ecommerce-vans-joseottonello.vercel.app/",
        "repo": "https://github.com/joseottonello/EcommerceVans"
    },
    {
        "type": "portfolio",
        "name": "Inmobiliaria Online",
        "description": "Inmobiliaria como proyecto final para el curso de JavaScript de Coderhouse en el que mediante la interaccion de HTML, CSS y JavaScript sumado a la utilizaci贸n de Bootstrap y SASS logr茅 la creaci贸n de una alternativa que ahorre tiempo y dinero con la posibilidad de reservar una propiedad mediante la pagina y evitar colision en la inmobiliaria fisica como tambien visitar mas de una propiedad.",
        "path": "./images/onlinerentals.gif",
        "deploy": "https://online-rentals-joseottonello.vercel.app/",
        "repo": "https://github.com/joseottonello/OnlineRentals"
    },
    {
        "type": "portfolio",
        "name": "Aplicaci贸n Calculadora funcional",        
        "description": "Uno de los proyectos mas convencionales para practicar la logica programacional, pero de mucha utilidad para agilizar el uso de funciones, condionales, clases, metodos de arreglos y demas. Es una calculadora funcional que es de gran ayuda para el uso cotidiano.",
        "path": "./images/calculator.gif",
        "deploy": "https://calculator-app-joseottonello.vercel.app/",
        "repo": "https://github.com/joseottonello/Calculator-App"
    },
    {
        "type": "portfolio",
        "name": "Aplicaci贸n Anotador de mano",        
        "description": "Todos necesitamos un anotador a mano a la hora de estudiar o trabajar y el uso de la hoja en papel comienza a caducar, me parecio un buen proyecto para mantener todo el ecosistema de estudio/trabajo en el computador. Fue de gran ayuda para practicar el uso de eventos, almacenar datos en el almacenamiento local del navegador, metodos de objetos, parsear a JSON y demas. Es una aplicacion que recomiendo, a mi me sirve mucho a organizarme, es minimalista y practico. ",
        "path": "./images/notes.gif",
        "deploy": "https://notes-app-joseottonello.vercel.app/",
        "repo": "https://github.com/joseottonello/Notes-App"
    },
    {
        "type": "portfolio",
        "name": "Aplicaci贸n To do List",
        "description": "Este proyecto surgio a partir de la aplicaci贸n anterior 'Anotador de mano', sent铆a la necesidad de desglosar una tarea sin volver mas extensa la aplicaci贸n anterior, Este To do List es muy util para subdividir tareas e ir tachando a medida que se realizan, en su creacion utilic茅 clases, eventos, manejo de fechas, destructuraci贸n, condicionales. Recomiendo practicarlo y tambien utlizarlo, es un complemento al proyecto anterior y es de gran utilidad.",
        "path": "./images/todolist.gif",
        "deploy": "https://todo-list-app-joseottonello.vercel.app/",
        "repo": "https://github.com/joseottonello/TodoList-App"
    },
    {
        "name": "Lenguajes Principales", 
        "type": "skill",       
        "icon1": "https://img.icons8.com/wired/60/000000/html-5.png",
        "icon2": "https://img.icons8.com/wired/60/000000/css3.png",
        "icon3": "https://img.icons8.com/wired/60/000000/javascript-logo.png",
        "description": "Para insertarme en el universo IT comenc茅 por realizar proyectos con sus tres lenguajes principales como lo son HTML lenguaje de marcado, CSS lenguaje de estilizaci贸n y JavaScript lenguaje de programaci贸n."
    },
    {
        "name": "Programaci贸n Avanzada", 
        "type": "skill",       
        "icon1": "//img.icons8.com/ios/65/000000/react-native--v1.png",
        "icon2": "https://img.icons8.com/ios/60/000000/redux.png",
        "description": "Con el objetivo de lograr un mayor rendimiento y mejorar la calidad de mis proyectos decid铆 interiorizarme en React, libreria basada en JavaScript mas demandada del mercado y la compatibilidad con demas librerias como Redux para el manejo de estados."
    },
    {
        "name": "Librerias y Preprocesadores", 
        "type": "skill",
        "icon1": "https://img.icons8.com/ios/60/000000/sass-avatar.png",
        "icon2": "https://img.icons8.com/external-tal-revivo-light-tal-revivo/60/000000/external-bootstrap-a-free-and-open-source-css-framework-logo-light-tal-revivo.png",
        "description": "Para mantener un codigo ordenado y optimizado usualmente utilizo SASS, me permite reutilizar muchas piezas de codigo aunque tambien librerias como Bootstrap y Styled Components suelo involucrarlas en mis proyectos."
    },
    {
        "name": "Base de Datos", 
        "type": "skill",
        "icon1": "https://img.icons8.com/external-outline-juicy-fish/60/000000/external-sql-coding-and-development-outline-outline-juicy-fish.png",
        "icon2": "https://img.icons8.com/external-tal-revivo-regular-tal-revivo/60/000000/external-firebase-a-googles-mobile-platform-that-helps-you-quickly-develop-high-quality-apps-logo-regular-tal-revivo.png",
        "description": "El almacenamiento de datos es de suma importancia para el registro de la interaccion de los usuarios con el sitio web, por eso bases de datos como SQL y Firebase me permiten almacenar datos relacional y no relacional respectivamente."
    },
    {
        "name": "software de control de versiones", 
        "type": "tool",
        "icon": "https://img.icons8.com/ios/60/000000/git.png",
        "description": "Esencial para cualquier desarollador, almaceno cada uno de mis proyectos en Git, me permite regresar a versiones anteriores si me encuentro con inconvenientes, ramificar un mismo proyecto, mantener guardados proyectos que ya esten finalizados sin ocupar espacio en mi computador, son algunas de las funcionalidades que mas utilizo."
    },
    {
        "name": "Software de gestion de proyectos", 
        "type": "tool",
        "icon": "https://img.icons8.com/material-outlined/60/000000/notion--v1.png",
        "description": "Herramienta en la cual organizo y separo las tareas de cada dia, correspondiente a cada proyecto que me encuentre realizando y documento la informaci贸n de cada lenguaje, libreria y frameworks que voy aprendiendo."
    }
]